# Pandas

In [2]:
import pandas as pd

In [6]:
seri=pd.Series([4,7,1,9])
seri

0    4
1    7
2    1
3    9
dtype: int64

In [7]:
type(seri)

pandas.core.series.Series

In [8]:
seri.axes

[RangeIndex(start=0, stop=4, step=1)]

In [9]:
seri.dtype

dtype('int64')

In [10]:
seri.size

4

In [11]:
seri.ndim

1

In [13]:
seri.values

array([4, 7, 1, 9], dtype=int64)

In [14]:
seri.head()

0    4
1    7
2    1
3    9
dtype: int64

In [15]:
seri.tail(3)

1    7
2    1
3    9
dtype: int64

In [14]:
seri1=pd.Series([4,7,1,9],index=["a","b","c","d"])
seri2=pd.Series([2,0,3,8],index=["e","f","g","h"])
seri2

e    2
f    0
g    3
h    8
dtype: int64

In [16]:
birlesim=pd.concat([seri1,seri2])
birlesim

a    4
b    7
c    1
d    9
e    2
f    0
g    3
h    8
dtype: int64

In [23]:
# List, Array veya Dictionary Seri yapılabilir
a=[1,2,3,4,5]
import numpy as np
b=np.array([6,7,8,9])
c={"a":55,"b":44,"c":33}
seri1=pd.Series(a)
seri2=pd.Series(b)
seri3=pd.Series(c)

In [24]:
seri3["c"]

33

In [25]:
seri1[0:3]

0    1
1    2
2    3
dtype: int64

In [26]:
seri3.index

Index(['a', 'b', 'c'], dtype='object')

In [32]:
seri3.keys

<bound method Series.keys of a    55
b    44
c    33
dtype: int64>

In [34]:
list(seri3.items())

[('a', 55), ('b', 44), ('c', 33)]

In [35]:
"b" in seri3

True

In [38]:
2 in seri2

True

## Data Frame Oluşturma

In [39]:
# Liste ile DF oluşturma
l=[2,4,6,8]

In [40]:
pd.DataFrame(l,columns=["degisken"])

   degisken
0         2
1         4
2         6
3         8

In [44]:
# Array ile DF oluşturma
m=np.arange(1,10).reshape(3,3)
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [48]:
df=pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [49]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [51]:
df.columns = ("deg1","deg2","deg3")
df.columns

Index(['deg1', 'deg2', 'deg3'], dtype='object')

In [52]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [55]:
hh=pd.DataFrame(seri3,columns=["degisken"])
hh

   degisken
a        55
b        44
c        33

In [56]:
s1 = np.random.randint(10, size=4)
s2 = np.random.randint(10, size=4)
s3 = np.random.randint(10, size=4)
sozluk={"var1":s1,"var2":s2,"var3":s3}
sozluk

{'var1': array([5, 4, 9, 8]),
 'var2': array([2, 3, 9, 0]),
 'var3': array([6, 9, 0, 7])}

In [59]:
df1=pd.DataFrame(sozluk)
df1

   var1  var2  var3
0     5     2     6
1     4     3     9
2     9     9     0
3     8     0     7

In [60]:
df1[0:1]

   var1  var2  var3
0     5     2     6

In [61]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [64]:
df1.index=("a","b","c","d")
df1

   var1  var2  var3
a     5     2     6
b     4     3     9
c     9     9     0
d     8     0     7

In [65]:
# satır silme
df1.drop("b", axis=0)

   var1  var2  var3
a     5     2     6
c     9     9     0
d     8     0     7

In [70]:
df1.drop("var1", axis=1)

   var2  var3
a     2     6
b     3     9
c     9     0
d     0     7

In [69]:
l=["c","d"]
df1.drop(l,axis=0)

   var1  var2  var3
a     5     2     6
b     4     3     9

In [73]:
# kalıcı silme
df1.drop("a", axis=0, inplace=True)
df1

   var1  var2  var3
c     9     9     0
d     8     0     7

In [74]:
l=["var1","var4","var2"]
for i in l:
    print (i in df1)

True
False
True

In [77]:
df1["var4"]=df1["var1"]*df1["var2"]
df1

   var1  var2  var3  var4
c     9     9     0    81
d     8     0     7     0

### Loc & iloc

In [78]:
import numpy as np
import pandas as pd
m=np.random.randint(1,30, size=(10,3))
df=pd.DataFrame(m,columns=["Var1","Var2","Var3"])
df

   Var1  Var2  Var3
0    29     6     8
1     3     2     7
2     6    16    29
3    26    16    22
4    12    11    26
5     7    17    10
6    11    28     8
7    27     4    15
8     3     4     9
9     1    26    26

In [79]:
df[0:3]

   Var1  Var2  Var3
0    29     6     8
1     3     2     7
2     6    16    29

In [80]:
df.loc[0:3] # indexte ne varsa onu verir

   Var1  Var2  Var3
0    29     6     8
1     3     2     7
2     6    16    29
3    26    16    22

In [81]:
df.iloc[0:3] # bildiğimiz indexlemeye göre verir

   Var1  Var2  Var3
0    29     6     8
1     3     2     7
2     6    16    29

In [86]:
df.iloc[0,0]

29

In [87]:
df.iloc[:3,:2]

   Var1  Var2
0    29     6
1     3     2
2     6    16

In [90]:
df.loc[0:3,"Var2":"Var3"]

   Var2  Var3
0     6     8
1     2     7
2    16    29
3    16    22

In [92]:
df[0:2][["Var2","Var3"]]

   Var2  Var3
0     6     8
1     2     7

In [93]:
df.Var1

0    29
1     3
2     6
3    26
4    12
5     7
6    11
7    27
8     3
9     1
Name: Var1, dtype: int32

In [94]:
df[df.Var1>10] # koşullu seçim

   Var1  Var2  Var3
0    29     6     8
3    26    16    22
4    12    11    26
6    11    28     8
7    27     4    15

In [96]:
df[(df.Var1>10) & (df.Var2<20) ]

   Var1  Var2  Var3
0    29     6     8
3    26    16    22
4    12    11    26
7    27     4    15

In [101]:
df.loc[(df.Var1>10) ,["Var1","Var2"]]

   Var1  Var2
0    29     6
3    26    16
4    12    11
6    11    28
7    27     4

In [102]:
df[(df.Var1>10)][["Var1","Var2"]]

   Var1  Var2
0    29     6
3    26    16
4    12    11
6    11    28
7    27     4

In [103]:
df2=df+10
df2

   Var1  Var2  Var3
0    39    16    18
1    13    12    17
2    16    26    39
3    36    26    32
4    22    21    36
5    17    27    20
6    21    38    18
7    37    14    25
8    13    14    19
9    11    36    36

In [104]:
pd.concat([df,df2])

   Var1  Var2  Var3
0    29     6     8
1     3     2     7
2     6    16    29
3    26    16    22
4    12    11    26
5     7    17    10
6    11    28     8
7    27     4    15
8     3     4     9
9     1    26    26
0    39    16    18
1    13    12    17
2    16    26    39
3    36    26    32
4    22    21    36
5    17    27    20
6    21    38    18
7    37    14    25
8    13    14    19
9    11    36    36

In [106]:
pd.concat([df,df2], ignore_index=True)

    Var1  Var2  Var3
0     29     6     8
1      3     2     7
2      6    16    29
3     26    16    22
4     12    11    26
5      7    17    10
6     11    28     8
7     27     4    15
8      3     4     9
9      1    26    26
10    39    16    18
11    13    12    17
12    16    26    39
13    36    26    32
14    22    21    36
15    17    27    20
16    21    38    18
17    37    14    25
18    13    14    19
19    11    36    36

In [113]:
df2["Var4"]=df2["Var3"]/df2["Var2"]
df2

   Var1  Var2  Var3      Var4
0    39    16    18  1.125000
1    13    12    17  1.416667
2    16    26    39  1.500000
3    36    26    32  1.230769
4    22    21    36  1.714286
5    17    27    20  0.740741
6    21    38    18  0.473684
7    37    14    25  1.785714
8    13    14    19  1.357143
9    11    36    36  1.000000

In [116]:
pd.concat([df,df2], join="inner", ignore_index=True)

    Var1  Var2  Var3
0     29     6     8
1      3     2     7
2      6    16    29
3     26    16    22
4     12    11    26
5      7    17    10
6     11    28     8
7     27     4    15
8      3     4     9
9      1    26    26
10    39    16    18
11    13    12    17
12    16    26    39
13    36    26    32
14    22    21    36
15    17    27    20
16    21    38    18
17    37    14    25
18    13    14    19
19    11    36    36

In [117]:
pd.concat([df,df2], join_axes=[df.columns], ignore_index=True)

    Var1  Var2  Var3
0     29     6     8
1      3     2     7
2      6    16    29
3     26    16    22
4     12    11    26
5      7    17    10
6     11    28     8
7     27     4    15
8      3     4     9
9      1    26    26
10    39    16    18
11    13    12    17
12    16    26    39
13    36    26    32
14    22    21    36
15    17    27    20
16    21    38    18
17    37    14    25
18    13    14    19
19    11    36    36

In [118]:
df1=pd.DataFrame({"Employees":["John","Joe","Jack","Avarel"],
                 "Title":["Driver","Engineer","CEO","Manager"]})
df2=pd.DataFrame({"Employees":["John","Joe","Jack","Avarel"],
                 "Started":[2010,2015,2019,1998]})

In [119]:
df2

  Employees  Started
0      John     2010
1       Joe     2015
2      Jack     2019
3    Avarel     1998

In [120]:
pd.merge(df1,df2)

  Employees     Title  Started
0      John    Driver     2010
1       Joe  Engineer     2015
2      Jack       CEO     2019
3    Avarel   Manager     1998

In [121]:
pd.merge(df1,df2, on="Employees")

  Employees     Title  Started
0      John    Driver     2010
1       Joe  Engineer     2015
2      Jack       CEO     2019
3    Avarel   Manager     1998

In [147]:
import seaborn as sns
df=sns.load_dataset("planets")
df.head(5)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [128]:
df.shape

(1035, 6)

In [129]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [130]:
df.distance.mean()

264.06928217821786

In [132]:
df["distance"].mean()

264.06928217821786

In [134]:
df.distance.count()

808

In [135]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [136]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [137]:
df.dropna().std()

number               1.175720
orbital_period    1469.128259
mass                 3.636274
distance            46.596041
year                 4.167284
dtype: float64

In [144]:
df2=pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                "veri":[10,34,23,56,78,91]})
df2

  gruplar  veri
0       A    10
1       B    34
2       C    23
3       A    56
4       B    78
5       C    91

In [145]:
df2.groupby("gruplar").mean()

         veri
gruplar
A          33
B          56
C          57

In [151]:
df.groupby("method")["orbital_period"].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [153]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

In [154]:
df3=pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                "var1":[10,34,23,56,78,91],
                 "var2":[55,3,89,12,33,71]})
df3

  gruplar  var1  var2
0       A    10    55
1       B    34     3
2       C    23    89
3       A    56    12
4       B    78    33
5       C    91    71

In [155]:
df3.groupby("gruplar").aggregate([min,np.median,max])

        var1            var2
         min median max  min median max
gruplar
A         10     33  56   12   33.5  55
B         34     56  78    3   18.0  33
C         23     57  91   71   80.0  89

In [157]:
df3.groupby("gruplar").aggregate({"var1":min,"var2":max})

         var1  var2
gruplar
A          10    55
B          34    33
C          23    89

In [158]:
def filter_func(x):
    return x["var1"].std()>8

In [159]:
df3.groupby("gruplar").filter(filter_func)

  gruplar  var1  var2
0       A    10    55
1       B    34     3
2       C    23    89
3       A    56    12
4       B    78    33
5       C    91    71

In [164]:
df3_a=df3.iloc[:,1:3]
df3_a.transform(lambda x: x-x.mean())

        var1       var2
0 -38.666667  11.166667
1 -14.666667 -40.833333
2 -25.666667  45.166667
3   7.333333 -31.833333
4  29.333333 -10.833333
5  42.333333  27.166667

In [165]:
df3.sum()

gruplar    ABCABC
var1          292
var2          263
dtype: object

In [167]:
df3.apply(np.sum)

gruplar    ABCABC
var1          292
var2          263
dtype: object

In [171]:
df3.groupby("gruplar").apply(lambda x: x.std()**2)

           var1   var2
gruplar
A        1058.0  924.5
B         968.0  450.0
C        2312.0  162.0

## Pivot Tables

In [175]:
import pandas as pd
import seaborn as sns
titanic=sns.load_dataset("titanic")
titanic.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [178]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [182]:
titanic.groupby(["sex","class"])[["survived"]].aggregate(np.mean).unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [184]:
# Bunun kısası
titanic.pivot_table("survived", index="sex", columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [183]:
age=pd.cut(titanic["age"],[0,20,50,90])
age.head(5)

0    (20, 50]
1    (20, 50]
2    (20, 50]
3    (20, 50]
4    (20, 50]
Name: age, dtype: category
Categories (3, interval[int64]): [(0, 20] < (20, 50] < (50, 90]]

In [185]:
titanic.pivot_table("survived",["sex",age],"class")

class               First    Second     Third
sex    age
female (0, 20]   0.928571  1.000000  0.510638
       (20, 50]  0.965517  0.909091  0.407407
       (50, 90]  1.000000  0.666667  1.000000
male   (0, 20]   0.571429  0.526316  0.197368
       (20, 50]  0.455882  0.058824  0.136905
       (50, 90]  0.192308  0.083333  0.000000

## Dış Kaynaklı Veri Okumak

In [188]:
# csv okuma
pd.read_csv("reading_data\ornekcsv.csv", sep=";")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [190]:
# txt okuma
pd.read_csv("reading_data\duz_metin.txt")

    1 2
0   2 2
1   3 2
2   4 2
3   5 2
4   6 2
5  7 2
6   8 2
7   9 2
8  10 2

In [192]:
# excel okuma
pd.read_excel("reading_data\ornekx.xlsx")

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0